In [1]:
import pandas as pd
import seaborn as sns
tips = sns.load_dataset('tips')
import re

### Skipping initital blank rows while importing the dataset

In [2]:
data = pd.read_excel(r'C:\Users\SHASHI\OneDrive\Course Work\Data Analytics\Cleaning Data Practice_Data Analytics.xlsx',
                skiprows = 5)

In [3]:
data.columns = data.columns.str.strip()

In [4]:
data.isnull().sum()  / data.shape[0]

Program Code          0.694561
Program Name          0.669456
Level                 0.334728
Number of Students    0.372385
Unnamed: 4            1.000000
School                0.334728
Deposit Amount        0.334728
dtype: float64

In [5]:
data = data.dropna( how = 'all'  , axis = 'columns'  )

In [6]:
data = data.dropna( how = 'all'  , axis = 'index'  )

In [9]:
data['Program Name'].replace(" ", np.nan)

NameError: name 'np' is not defined

In [129]:
data = data.replace(" ", np.nan)

In [10]:
data['Number of Students'].sum()

14015.0

In [11]:
A.isnull().sum()

NameError: name 'A' is not defined

In [ ]:
"True" 

True Boolean Data
False

In [31]:
data.columns

Index([' Program Code    ', '  Program Name  ', 'Level',
       'Number of Students  ', 'Unnamed: 4', 'School', '   Deposit Amount '],
      dtype='object')

In [107]:
data.isnull().sum()

 Program Code           166
  Program Name          160
Level                    80
Number of Students       89
Unnamed: 4              239
School                   80
   Deposit Amount        80
dtype: int64

In [114]:
data['  Program Name  ']

0                             NaN
1      Medical Laboratory Science
2                             NaN
3
4                             NaN
                  ...
234                           NaN
235                           NaN
236                           NaN
237                           NaN
238                   GRAND TOTAL
Name:   Program Name  , Length: 239, dtype: object

In [115]:
'  Program Name  '.strip()

'Program Name'

In [119]:
data.head()

,Program Code,Program Name,Level,Number of Students,Unnamed: 4,School,Deposit Amount
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,K3135,Medical Laboratory Science,S1,53.0,NaN,HS,500.0
2,NaN,NaN,S3,38.0,NaN,HS,500.0
3,NaN,,S5,13.0,NaN,HS,500.0
4,NaN,NaN,S6,9.0,NaN,HS,500.0

In [138]:
data.columns = data.columns.str.strip()

In [122]:
data.columns

Index(['Program Code', 'Program Name', 'Level', 'Number of Students',
       'Unnamed: 4', 'School', 'Deposit Amount'],
      dtype='object')

In [139]:
data #= data.dropna(how = 'all' , axis = 1)

,Program Code,Program Name,Level,Number of Students,Unnamed: 4,School,Deposit Amount
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,K3135,Medical Laboratory Science,S1,53.0,NaN,HS,500.0
2,NaN,NaN,S3,38.0,NaN,HS,500.0
3,NaN,,S5,13.0,NaN,HS,500.0
4,NaN,NaN,S6,9.0,NaN,HS,500.0
...,...,...,...,...,...,...,...
234,NaN,NaN,S2,102.0,NaN,STT,500.0
235,NaN,NaN,S3,45.0,NaN,STT,500.0
236,NaN,NaN,S4,33.0,NaN,STT,500.0
237,NaN,NaN,NaN,NaN,NaN,NaN,NaN
238,NaN,GRAND TOTAL,NaN,5966.0,NaN,NaN,NaN

In [131]:
data = data.dropna(subset = 'Level' )

In [132]:
data =  data.dropna(how = 'all' , axis = 1 )

In [133]:
data['Number of Students'].sum()

5966.0

In [121]:
data.fillna(method = 'ffill'  , inplace= True )#.to_excel("")

In [137]:
data[['Program Code','Program Name']]    = data[['Program Code','Program Name']].fillna(method='ffill' )

In [141]:
data.to_excel("CORRECT FILE - Cleaned College File for Boss.xlsx")

In [117]:
tips['total_bill'].fillna(   )

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [113]:
import numpy as np
np.nan

nan

In [130]:
"NaN"

'NaN'

In [12]:
data.columns.str.strip()

Index(['Program Code', 'Program Name', 'Level', 'Number of Students', 'School',
       'Deposit Amount'],
      dtype='object')

In [5]:

data = data.dropna(how= 'all', axis = 0 ) # Deleting totally blank rows
data = data.dropna(how= 'all', axis = 1 ) # Deleting totally blank columns

In [6]:
data.columns  # There are extra trailing and leading spaces in column names

Index([' Program Code    ', '  Program Name  ', 'Level',
       'Number of Students  ', 'School', '   Deposit Amount '],
      dtype='object')

In [7]:
data.columns = data.columns.str.strip() # stripping spaces from column names and reassigning the clean column names to the dataset

In [8]:
data = data.replace(' ', None ) # replacing any spaces with Null values so that we can use fillna method

In [9]:
data = data.dropna(subset = ['Level','Number of Students']) # Deleting all rows where Level and Number of Students are not mentioned. 
## this deletes all subtotals
data = data.fillna(method = 'ffill') # Forward filling the dataset

In [10]:
data['Number of Students'].sum()

5966.0

In [11]:
data

,Program Code,Program Name,Level,Number of Students,School,Deposit Amount
1,K3135,Medical Laboratory Science,S1,53.0,HS,500.0
2,K3135,Medical Laboratory Science,S3,38.0,HS,500.0
3,K3135,Medical Laboratory Science,S5,13.0,HS,500.0
4,K3135,Medical Laboratory Science,S6,9.0,HS,500.0
6,K3263,Advertising and Marketing Communications,S1,88.0,BUS,500.0
...,...,...,...,...,...,...
231,K1395,Pre-Health Sciences Pathway to Advanced Diplom...,S1,51.0,HS,500.0
233,F1202,Masters in Data Science,S1,97.0,STT,500.0
234,F1202,Masters in Data Science,S2,102.0,STT,500.0
235,F1202,Masters in Data Science,S3,45.0,STT,500.0
236,F1202,Masters in Data Science,S4,33.0,STT,500.0

In [21]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [19]:
tips['sex'].values

['Female', 'Male', 'Male', 'Male', 'Female', ..., 'Male', 'Female', 'Male', 'Male', 'Female']
Length: 244
Categories (2, object): ['Male', 'Female']

In [27]:
"I am living in USA"[:6]

'I am l'

In [29]:
"N4W8G2-Kitchiner"[-6:]

'chiner'

In [23]:
A = [5,6,6,9,10]

In [24]:
A[:3]

[5, 6, 6]

In [39]:
tips.sum()

<ipython-input-39-8e3da4079cfc>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  tips.sum()

total_bill    4827.77
tip            731.58
size           627.00
dtype: float64

In [41]:
"I am living in USA".replace("USA" , "Canada")

'I am living in Canada'

In [45]:
"india china america asia pakistan iran".upper().replace("ASIA","JAPAN").lower()

'india china america japan pakistan iran'

In [50]:
"Alexander Jones".split()

['Alexander', 'Jones']

In [57]:
"T3J-3G4-6J4".split( sep = "-" )

['T3J', '3G4-6J4']

In [60]:
"My name is Alex and my phone number is 8912093"[-7:]

'8912093'

In [61]:
"My name is Bob and my phone number is 9912093"[-7:]

'9912093'

In [69]:
re.findall( '\d\d\d\d\d\d\d'  , "My name is Bob I am very happy oh my number is is 9912091. By the way weather is great " )

['9912091']

In [73]:
re.findall( '\D\d\D\d\D\d'  , "My name is Bob. my postal code is R2L6T8. I am very happy oh my number is is 9912091. By the way weather is great. " )

['R2L6T8']

In [77]:
re.findall( '[A-Z]\dsd\t\D\w\,"" name is Bob. my postal code is R2L6T8. I am very happy oh my number is is 9912091. By the way weather is great. ")

['M', 'B', 'R', 'L', 'T', 'I', 'B']

In [80]:
"Sun".replace("Sun","Sunday")

'Sunday'

In [96]:
tips['day'].str.lower()

0       sun
1       sun
2       sun
3       sun
4       sun
       ...
239     sat
240     sat
241     sat
242     sat
243    thur
Name: day, Length: 244, dtype: object

In [83]:
"Sun".upper()

'SUN'

In [90]:
tips['day'][:2]

0    Sun
1    Sun
Name: day, dtype: category
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [91]:
tips['day'].str[:2]

0      Su
1      Su
2      Su
3      Su
4      Su
       ..
239    Sa
240    Sa
241    Sa
242    Sa
243    Th
Name: day, Length: 244, dtype: object

In [97]:
tips['size'].sum()

627

In [98]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]